
Процедура ПередПодключением(Клиент)
	а=1;
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение)
	а=1;
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	Если СтрНайти(Сообщение, "__BENCHMARK_DATA__")>0 Тогда
		//ПараметрыСеанса.КоличествоСообщений = ПараметрыСеанса.КоличествоСообщений + 1;
		Возврат;
	ИначеЕсли СтрНачинаетсяС(Сообщение, "__BENCHMARK_START__")>0 Тогда
		ПараметрыСеанса.НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
		мч = СтрРазделить(Сообщение, ":");
		ПараметрыСеанса.КоличествоСообщений = Число(мч[1]);
		УведомленияКлиента.ОтправитьУведомление("ws", "Начало замера: " + Сообщение);
		Возврат;
	ИначеЕсли СтрНайти(Сообщение, "__BENCHMARK_END__")>0 Тогда
		Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ПараметрыСеанса.НачалоЗамера)/1000;
		Количество = ПараметрыСеанса.КоличествоСообщений;
		УведомленияКлиента.ОтправитьУведомление("ws", СтрШаблон("Количество: %1; Время: %2; Скорость: %3 mes/s", Количество, Время, Количество/Время));
		Возврат;
	КонецЕсли;
	УведомленияКлиента.ОтправитьУведомление("ws", Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	УведомленияКлиента.ОтправитьУведомление("ws", 
		СтрШаблон("Ошибка: код %1 = %2", КодОшибки, Описание));
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	УведомленияКлиента.ОтправитьУведомление("ws", 
		СтрШаблон("Соединение закрыто: код %1", КодЗакрытия));
КонецПроцедуры
