
Процедура ПередПодключением(Клиент)
	а=1;
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение)
	а=1;
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	Если СтрНайти(Сообщение, "__BENCHMARK_DATA__")>0 Тогда
		Возврат;
	КонецЕсли;
	УведомленияКлиента.ОтправитьУведомление("ws", Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	УведомленияКлиента.ОтправитьУведомление("ws", 
		СтрШаблон("Ошибка: код %1 = %2", КодОшибки, Описание));
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	УведомленияКлиента.ОтправитьУведомление("ws", 
		СтрШаблон("Соединение закрыто: код %1", КодЗакрытия));
КонецПроцедуры
