
&НаКлиенте
Процедура Подключить(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	Соединение = Клиент().Подключить();
	Ключ = Соединение.Ключ;
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПриИзменении(Элемент)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	Соединение = Соединение(Ключ);
	Если Соединение = Неопределено Тогда
		Сообщить("Соединение не установлено");
		Возврат;
	КонецЕсли;
	Соединение.ОтправитьСообщение(Сообщение);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Клиент()
	
	Возврат WebSocketКлиенты.НайтиПредопределенный(Метаданные.WebSocketКлиенты.WebSocketКлиент1);

КонецФункции

&НаСервереБезКонтекста
Функция Соединение(Ключ=Неопределено)
	Если Ключ=Неопределено Тогда
		Возврат WebSocketКлиентСоединения.ПолучитьСоединения();
	Иначе
		Возврат WebSocketКлиентСоединения.ПолучитьСоединение(Ключ);
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ОтключитьНаСервере()
	Клиент().Отключить();
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	ОтключитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УведомленияКлиента.ПодключитьОбработчик("ws",
		Новый ОписаниеОповещения("НовоеСообщение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщение(П1,П2) Экспорт
	Ответы.ДобавитьСтроку(П1);
	ЭтаФорма.ТекущийЭлемент = Элементы.Сообщение;
КонецПроцедуры
